CoreMaker-lab/STM32C542_LSM6DOW_LIS2MDL/STM32C542CC_LSM6DSOW_Project1/STM32C542CC_LSM6DSOW_LIS2MDL_Project1_cmake/lsm6dso_reg.h
typedef enum
{
  LSM6DSO_LSb_1mg  = 0,
  LSM6DSO_LSb_16mg = 1,
} lsm6dso_usr_off_w_t;
int32_t lsm6dso_xl_offset_weight_set(const stmdev_ctx_t *ctx,
                                     lsm6dso_usr_off_w_t val);
int32_t lsm6dso_xl_offset_weight_get(const stmdev_ctx_t *ctx,
                                     lsm6dso_usr_off_w_t *val);

typedef enum
{
  LSM6DSO_HIGH_PERFORMANCE_MD  = 0,
  LSM6DSO_LOW_NORMAL_POWER_MD  = 1,
  LSM6DSO_ULTRA_LOW_POWER_MD   = 2,
} lsm6dso_xl_hm_mode_t;
int32_t lsm6dso_xl_power_mode_set(const stmdev_ctx_t *ctx,
                                  lsm6dso_xl_hm_mode_t val);
int32_t lsm6dso_xl_power_mode_get(const stmdev_ctx_t *ctx,
                                  lsm6dso_xl_hm_mode_t *val);

typedef enum
{
  LSM6DSO_GY_HIGH_PERFORMANCE  = 0,
  LSM6DSO_GY_NORMAL            = 1,
} lsm6dso_g_hm_mode_t;
int32_t lsm6dso_gy_power_mode_set(const stmdev_ctx_t *ctx,
                                  lsm6dso_g_hm_mode_t val);
int32_t lsm6dso_gy_power_mode_get(const stmdev_ctx_t *ctx,
                                  lsm6dso_g_hm_mode_t *val);

int32_t lsm6dso_status_reg_get(const stmdev_ctx_t *ctx,
                               lsm6dso_status_reg_t *val);

int32_t lsm6dso_xl_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lsm6dso_gy_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lsm6dso_temp_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                         uint8_t *val);

int32_t lsm6dso_xl_usr_offset_x_set(const stmdev_ctx_t *ctx, const uint8_t *buff);
int32_t lsm6dso_xl_usr_offset_x_get(const stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dso_xl_usr_offset_y_set(const stmdev_ctx_t *ctx, const uint8_t *buff);
int32_t lsm6dso_xl_usr_offset_y_get(const stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dso_xl_usr_offset_z_set(const stmdev_ctx_t *ctx, const uint8_t *buff);
int32_t lsm6dso_xl_usr_offset_z_get(const stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dso_xl_usr_offset_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_xl_usr_offset_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_timestamp_rst(const stmdev_ctx_t *ctx);

int32_t lsm6dso_timestamp_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_timestamp_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_timestamp_raw_get(const stmdev_ctx_t *ctx, uint32_t *val);

typedef enum
{
  LSM6DSO_NO_ROUND      = 0,
  LSM6DSO_ROUND_XL      = 1,
  LSM6DSO_ROUND_GY      = 2,
  LSM6DSO_ROUND_GY_XL   = 3,
} lsm6dso_rounding_t;
int32_t lsm6dso_rounding_mode_set(const stmdev_ctx_t *ctx,
                                  lsm6dso_rounding_t val);
int32_t lsm6dso_rounding_mode_get(const stmdev_ctx_t *ctx,
                                  lsm6dso_rounding_t *val);

int32_t lsm6dso_temperature_raw_get(const stmdev_ctx_t *ctx,  int16_t *val);

int32_t lsm6dso_angular_rate_raw_get(const stmdev_ctx_t *ctx,
                                     int16_t *val);

int32_t lsm6dso_acceleration_raw_get(const stmdev_ctx_t *ctx,
                                     int16_t *val);

int32_t lsm6dso_fifo_out_raw_get(const stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dso_number_of_steps_get(const stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm6dso_steps_reset(const stmdev_ctx_t *ctx);

int32_t lsm6dso_odr_cal_reg_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_odr_cal_reg_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSO_USER_BANK           = 0,
  LSM6DSO_SENSOR_HUB_BANK     = 1,
  LSM6DSO_EMBEDDED_FUNC_BANK  = 2,
} lsm6dso_reg_access_t;
int32_t lsm6dso_mem_bank_set(const stmdev_ctx_t *ctx,
                             lsm6dso_reg_access_t val);
int32_t lsm6dso_mem_bank_get(const stmdev_ctx_t *ctx,
                             lsm6dso_reg_access_t *val);

int32_t lsm6dso_ln_pg_write_byte(const stmdev_ctx_t *ctx, uint16_t address,
                                 const uint8_t *val);
int32_t lsm6dso_ln_pg_read_byte(const stmdev_ctx_t *ctx, uint16_t address,
                                uint8_t *val);

int32_t lsm6dso_ln_pg_write(const stmdev_ctx_t *ctx, uint16_t address,
                            const uint8_t *buf, uint8_t len);
int32_t lsm6dso_ln_pg_read(const stmdev_ctx_t *ctx, uint16_t address, uint8_t *buf,
                           uint8_t len);

typedef enum
{
  LSM6DSO_DRDY_LATCHED = 0,
  LSM6DSO_DRDY_PULSED  = 1,
} lsm6dso_dataready_pulsed_t;
int32_t lsm6dso_data_ready_mode_set(const stmdev_ctx_t *ctx,
                                    lsm6dso_dataready_pulsed_t val);
int32_t lsm6dso_data_ready_mode_get(const stmdev_ctx_t *ctx,
                                    lsm6dso_dataready_pulsed_t *val);

int32_t lsm6dso_device_id_get(const stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dso_reset_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_reset_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_auto_increment_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_auto_increment_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_boot_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_boot_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSO_XL_ST_DISABLE  = 0,
  LSM6DSO_XL_ST_POSITIVE = 1,
  LSM6DSO_XL_ST_NEGATIVE = 2,
} lsm6dso_st_xl_t;
int32_t lsm6dso_xl_self_test_set(const stmdev_ctx_t *ctx,
                                 lsm6dso_st_xl_t val);
int32_t lsm6dso_xl_self_test_get(const stmdev_ctx_t *ctx,
                                 lsm6dso_st_xl_t *val);

typedef enum
{
  LSM6DSO_GY_ST_DISABLE  = 0,
  LSM6DSO_GY_ST_POSITIVE = 1,
  LSM6DSO_GY_ST_NEGATIVE = 3,
} lsm6dso_st_g_t;
int32_t lsm6dso_gy_self_test_set(const stmdev_ctx_t *ctx,
                                 lsm6dso_st_g_t val);
int32_t lsm6dso_gy_self_test_get(const stmdev_ctx_t *ctx,
                                 lsm6dso_st_g_t *val);

int32_t lsm6dso_xl_filter_lp2_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_xl_filter_lp2_get(const stmdev_ctx_t *ctx, uint8_t *val);

