CoreMaker-lab/STM32C542_LSM6DOW_LIS2MDL/STM32C542CC_LSM6DSOW_Project1/STM32C542CC_LSM6DSOW_LIS2MDL_Project1_cmake/lsm6dso_reg.h
typedef enum
{
  LSM6DSO_ODR_FSM_12Hz5 = 0,
  LSM6DSO_ODR_FSM_26Hz  = 1,
  LSM6DSO_ODR_FSM_52Hz  = 2,
  LSM6DSO_ODR_FSM_104Hz = 3,
} lsm6dso_fsm_odr_t;
int32_t lsm6dso_fsm_data_rate_set(const stmdev_ctx_t *ctx,
                                  lsm6dso_fsm_odr_t val);
int32_t lsm6dso_fsm_data_rate_get(const stmdev_ctx_t *ctx,
                                  lsm6dso_fsm_odr_t *val);

int32_t lsm6dso_fsm_init_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_fsm_init_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_long_cnt_int_value_set(const stmdev_ctx_t *ctx,
                                       uint16_t val);
int32_t lsm6dso_long_cnt_int_value_get(const stmdev_ctx_t *ctx,
                                       uint16_t *val);

int32_t lsm6dso_fsm_number_of_programs_set(const stmdev_ctx_t *ctx,
                                           uint8_t val);
int32_t lsm6dso_fsm_number_of_programs_get(const stmdev_ctx_t *ctx,
                                           uint8_t *val);

int32_t lsm6dso_fsm_start_address_set(const stmdev_ctx_t *ctx,
                                      uint16_t val);
int32_t lsm6dso_fsm_start_address_get(const stmdev_ctx_t *ctx,
                                      uint16_t *val);

int32_t lsm6dso_sh_read_data_raw_get(const stmdev_ctx_t *ctx, uint8_t *val,
                                     uint8_t len);

typedef enum
{
  LSM6DSO_SLV_0       = 0,
  LSM6DSO_SLV_0_1     = 1,
  LSM6DSO_SLV_0_1_2   = 2,
  LSM6DSO_SLV_0_1_2_3 = 3,
} lsm6dso_aux_sens_on_t;
int32_t lsm6dso_sh_slave_connected_set(const stmdev_ctx_t *ctx,
                                       lsm6dso_aux_sens_on_t val);
int32_t lsm6dso_sh_slave_connected_get(const stmdev_ctx_t *ctx,
                                       lsm6dso_aux_sens_on_t *val);

int32_t lsm6dso_sh_master_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_sh_master_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSO_EXT_PULL_UP      = 0,
  LSM6DSO_INTERNAL_PULL_UP = 1,
} lsm6dso_shub_pu_en_t;
int32_t lsm6dso_sh_pin_mode_set(const stmdev_ctx_t *ctx,
                                lsm6dso_shub_pu_en_t val);
int32_t lsm6dso_sh_pin_mode_get(const stmdev_ctx_t *ctx,
                                lsm6dso_shub_pu_en_t *val);

int32_t lsm6dso_sh_pass_through_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_sh_pass_through_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSO_EXT_ON_INT2_PIN = 1,
  LSM6DSO_XL_GY_DRDY      = 0,
} lsm6dso_start_config_t;
int32_t lsm6dso_sh_syncro_mode_set(const stmdev_ctx_t *ctx,
                                   lsm6dso_start_config_t val);
int32_t lsm6dso_sh_syncro_mode_get(const stmdev_ctx_t *ctx,
                                   lsm6dso_start_config_t *val);

typedef enum
{
  LSM6DSO_EACH_SH_CYCLE    = 0,
  LSM6DSO_ONLY_FIRST_CYCLE = 1,
} lsm6dso_write_once_t;
int32_t lsm6dso_sh_write_mode_set(const stmdev_ctx_t *ctx,
                                  lsm6dso_write_once_t val);
int32_t lsm6dso_sh_write_mode_get(const stmdev_ctx_t *ctx,
                                  lsm6dso_write_once_t *val);

int32_t lsm6dso_sh_reset_set(const stmdev_ctx_t *ctx);
int32_t lsm6dso_sh_reset_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSO_SH_ODR_104Hz = 0,
  LSM6DSO_SH_ODR_52Hz  = 1,
  LSM6DSO_SH_ODR_26Hz  = 2,
  LSM6DSO_SH_ODR_13Hz  = 3,
} lsm6dso_shub_odr_t;
int32_t lsm6dso_sh_data_rate_set(const stmdev_ctx_t *ctx,
                                 lsm6dso_shub_odr_t val);
int32_t lsm6dso_sh_data_rate_get(const stmdev_ctx_t *ctx,
                                 lsm6dso_shub_odr_t *val);

typedef struct
{
  uint8_t   slv0_add;
  uint8_t   slv0_subadd;
  uint8_t   slv0_data;
} lsm6dso_sh_cfg_write_t;
int32_t lsm6dso_sh_cfg_write(const stmdev_ctx_t *ctx,
                             const lsm6dso_sh_cfg_write_t *val);

typedef struct
{
  uint8_t   slv_add;
  uint8_t   slv_subadd;
  uint8_t   slv_len;
} lsm6dso_sh_cfg_read_t;
int32_t lsm6dso_sh_slv_cfg_read(const stmdev_ctx_t *ctx, uint8_t idx,
                                lsm6dso_sh_cfg_read_t *val);

int32_t lsm6dso_sh_status_get(const stmdev_ctx_t *ctx,
                              lsm6dso_status_master_t *val);

typedef struct
{
  uint8_t ui;
  uint8_t aux;
} lsm6dso_id_t;
int32_t lsm6dso_id_get(const stmdev_ctx_t *ctx, const stmdev_ctx_t *aux_ctx,
                       lsm6dso_id_t *val);

typedef enum
{
  LSM6DSO_SEL_BY_HW   = 0x00, /* bus mode select by HW (SPI 3W disable) */
  LSM6DSO_SPI_4W      = 0x06, /* Only SPI: SDO / SDI separated pins */
  LSM6DSO_SPI_3W      = 0x07, /* Only SPI: SDO / SDI share the same pin */
  LSM6DSO_I2C         = 0x04, /* Only I2C */
  LSM6DSO_I3C_T_50us  = 0x02, /* I3C: available time equal to 50 us */
  LSM6DSO_I3C_T_2us   = 0x12, /* I3C: available time equal to 2 us */
  LSM6DSO_I3C_T_1ms   = 0x22, /* I3C: available time equal to 1 ms */
  LSM6DSO_I3C_T_25ms  = 0x32, /* I3C: available time equal to 25 ms */
} lsm6dso_ui_bus_md_t;

typedef enum
{
  LSM6DSO_SPI_4W_AUX  = 0x00,
  LSM6DSO_SPI_3W_AUX  = 0x01,
} lsm6dso_aux_bus_md_t;

typedef struct
{
  lsm6dso_ui_bus_md_t ui_bus_md;
  lsm6dso_aux_bus_md_t aux_bus_md;
} lsm6dso_bus_mode_t;
int32_t lsm6dso_bus_mode_set(const stmdev_ctx_t *ctx,
                             const stmdev_ctx_t *aux_ctx,
                             lsm6dso_bus_mode_t val);
int32_t lsm6dso_bus_mode_get(const stmdev_ctx_t *ctx,
                             const stmdev_ctx_t *aux_ctx,
                             lsm6dso_bus_mode_t *val);

typedef enum
{
  LSM6DSO_DRV_RDY   = 0x00, /* Initialize the device for driver usage */
  LSM6DSO_BOOT      = 0x01, /* Restore calib. param. ( it takes 10ms ) */
  LSM6DSO_RESET     = 0x02, /* Reset configuration registers */
  LSM6DSO_FIFO_COMP = 0x04, /* FIFO compression initialization request. */
  LSM6DSO_FSM       = 0x08, /* Finite State Machine initialization request */
  LSM6DSO_PEDO      = 0x20, /* Pedometer algo initialization request. */
  LSM6DSO_TILT      = 0x40, /* Tilt algo initialization request */
  LSM6DSO_SMOTION   = 0x80, /* Significant Motion initialization request */
} lsm6dso_init_t;
